// src/components/Story.js
import React from "react";
import { Container } from "react-bootstrap";

export default function Story() {
  const storyText =
    "Бидний учрал бол санамсаргүй бус, харин Бурханы хүслээр заяасан учрал байсан. Эхэндээ богинохон яриа байсан ч,  тэр мөч сэтгэлд тод үлдэж, цаашдын аяллын эхлэл болсон юм. Удалгүй бидний харилцаа илүү ойр болж, бие биедээ итгэж, хамтдаа инээж, суралцаж, аялж, олон дурсамжийг бүтээсэн. Энэ бүх хугацаанд бид нэгнээ олон өнцгөөс харж, таньж мэдэн, хайрлаж, нөхөрлөж, итгэл дээрээ тулгуурлан харилцаагаа бататгасан. Сорилт, бэрхшээл, баяр хөөрийн дунд Бурхан биднийг алхам бүрд удирдаж, нэг нэгэндээ түшиг тулгуур болохын үнэ цэнийг ойлгуулсан. Бүхний эцэст бид нэг нэгнээ албан ёсоор сонгож, Бурханы өмнө амьдралаа нэгтгэхээр шийдсэн. Бидний амьдралын гайхалтай аялал ийнхүү эхэлж байна. Бидний учрал тохиолдлын биш, харин Бурханы онцгой бэлэг байлаа. Хамгийн анх оюутны 3-р курст, оюутны хөдөлгөөнд хамрагдаж байхдаа танилцсан юм. Сарын дараа бид хоёрын нөхөрлөл эргэлзэх зүйлгүйгээр үерхэл болон өөрчлөгдсөн. Цаг хугацаа өнгөрөх тусам итгэлцэл, инээд хөөрөөр харилцаагаа баяжуулж, хамтдаа суралцан аялж, мартагдашгүй олон дурсамжийг бид бүтээсэн. Тэр бүхний дунд нэгнээ жинхэнэ утгаар нь таньж, нөхөрлөл, хайр, үнэнч байдлыг сууриа болгон харилцаагаа улам батжуулсан билээ. Сорилт бас баяр хөөр дунд Бурхан биднийг удирдан чиглүүлж, нэг нэгэндээ түшиг тулгуур байх үнэт зарчмыг ойлгуулсан. Ийнхүү бид нэг нэгнээ эргэлзээгүйгээр, чин сэтгэлээсээ сонгон, Бурханы өмнө амьдралаа нэгтгэн, хамгийн агуу аяллын босгон дээр хамтдаа зогсож байна."
  return (
    <section id="story" className="section py-3 section--blush">
      <Container>
        <div className="sectionCard storySingle">
          <h2 className="mb-3 title--lux">
            Бидний хайрын түүх
            <span className="titleAccent" />
          </h2>

          <p className="storyTextProse">
            {storyText}
          </p>
        </div>
      </Container>
    </section>
  );
}
